package cards;

public class Deck {

    public String[] Deck_Suit;
    public String[] Deck_Value;

    public Deck()
    {
    Deck_Suit[] = ["♦️", "♥️" , "♣️", "♠️","♦️", "♥️" , "♣️", "♠️","♦️", "♥️" , "♣️", "♠️","♦️", "♥️" , "♣️", "♠️","♦️", "♥️" , "♣️", "♠️","♦️", "♥️" , "♣️", "♠️","♦️", "♥️" , "♣️", "♠️","♦️", "♥️" , "♣️", "♠️","♦️", "♥️" , "♣️", "♠️","♦️", "♥️" , "♣️", "♠️","♦️", "♥️" , "♣️", "♠️","♦️", "♥️" , "♣️", "♠️","♦️", "♥️" , "♣️", "♠️"];
    Deck_Value[] =  {"A","A", "A", "A", "2", "2", "2", "2" , "3", "3", "3", "3", "4", "4", "4", "4","5","5","5","5", "6", "6", "6", "6" , "7", "7", "7", "7", "8", "8", "8", "8","9","9","9","9", "10", "10", "10", "10" , "J", "J", "J", "J", "Q", "Q", "Q", "Q", "K", "K", "K", "K"};
    }
public void shuffle(){

    public int random = ((int) (Math.random() * 52));
    public int random2 = ((int) (Math.random() * 52));



}  



}
